{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : 0.45073646306991577,
      "bias_r" : 0.45073646306991577,
      "bias_b" : 0.45073646306991577,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.015412801876664162
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_0_relu_output_relu",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_0_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_0_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_0_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_0_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_0_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_0_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_0_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_0_relu_output",
      "type" : "activation",
      "name" : "conv_0_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_1_relu_output_relu",
      "blob_weights" : 7,
      "K" : 16,
      "blob_biases" : 5,
      "name" : "conv_dw_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "conv_0_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_1_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_1_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_1_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_1_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_1_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_1_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_1_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_1_relu_output",
      "type" : "activation",
      "name" : "conv_dw_1_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_1_relu_output_relu",
      "blob_weights" : 11,
      "K" : 16,
      "blob_biases" : 9,
      "name" : "conv_pw_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_dw_1_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_1_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_1_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_1_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_1_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_1_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_1_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_1_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_1_relu_output",
      "type" : "activation",
      "name" : "conv_pw_1_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_2_relu_output_relu",
      "blob_weights" : 15,
      "K" : 32,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "conv_dw_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_pw_1_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_2_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_2_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_2_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_2_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_2_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_2_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_2_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_2_relu_output",
      "type" : "activation",
      "name" : "conv_dw_2_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_2_relu_output_relu",
      "blob_weights" : 19,
      "K" : 32,
      "blob_biases" : 17,
      "name" : "conv_pw_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_dw_2_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_2_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_2_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_2_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_2_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_2_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_2_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_2_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_2_relu_output",
      "type" : "activation",
      "name" : "conv_pw_2_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_3_relu_output_relu",
      "blob_weights" : 23,
      "K" : 64,
      "blob_biases" : 21,
      "name" : "conv_dw_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_pw_2_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_3_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_3_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_3_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_3_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_3_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_3_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_3_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_3_relu_output",
      "type" : "activation",
      "name" : "conv_dw_3_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_3_relu_output_relu",
      "blob_weights" : 27,
      "K" : 64,
      "blob_biases" : 25,
      "name" : "conv_pw_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_dw_3_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_3_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_3_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_3_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_3_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_3_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_3_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_3_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_3_relu_output",
      "type" : "activation",
      "name" : "conv_pw_3_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_4_relu_output_relu",
      "blob_weights" : 31,
      "K" : 64,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "conv_dw_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_pw_3_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_4_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_4_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_4_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_4_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_4_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_4_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_4_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_4_relu_output",
      "type" : "activation",
      "name" : "conv_dw_4_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_4_relu_output_relu",
      "blob_weights" : 35,
      "K" : 64,
      "blob_biases" : 33,
      "name" : "conv_pw_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_dw_4_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_4_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_4_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_4_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_4_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_4_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_4_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_4_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_4_relu_output",
      "type" : "activation",
      "name" : "conv_pw_4_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_5_relu_output_relu",
      "blob_weights" : 39,
      "K" : 128,
      "blob_biases" : 37,
      "name" : "conv_dw_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_pw_4_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_5_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_5_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_5_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_5_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_5_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_5_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_5_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_5_relu_output",
      "type" : "activation",
      "name" : "conv_dw_5_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_5_relu_output_relu",
      "blob_weights" : 43,
      "K" : 128,
      "blob_biases" : 41,
      "name" : "conv_pw_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_dw_5_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_5_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_5_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_5_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_5_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_5_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_5_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_5_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_5_relu_output",
      "type" : "activation",
      "name" : "conv_pw_5_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_6_relu_output_relu",
      "blob_weights" : 47,
      "K" : 128,
      "blob_biases" : 45,
      "stride_x" : 2,
      "name" : "conv_dw_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_pw_5_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_6_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_6_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_6_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_6_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_6_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_6_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_6_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_6_relu_output",
      "type" : "activation",
      "name" : "conv_dw_6_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_6_relu_output_relu",
      "blob_weights" : 51,
      "K" : 128,
      "blob_biases" : 49,
      "name" : "conv_pw_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_6_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_6_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_6_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_6_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_6_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_6_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_6_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_6_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_6_relu_output",
      "type" : "activation",
      "name" : "conv_pw_6_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_7_relu_output_relu",
      "blob_weights" : 55,
      "K" : 256,
      "blob_biases" : 53,
      "name" : "conv_dw_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_6_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_7_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_7_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_7_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_7_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_7_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_7_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_7_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_7_relu_output",
      "type" : "activation",
      "name" : "conv_dw_7_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_7_relu_output_relu",
      "blob_weights" : 59,
      "K" : 256,
      "blob_biases" : 57,
      "name" : "conv_pw_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_7_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_7_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_7_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_7_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_7_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_7_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_7_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_7_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_7_relu_output",
      "type" : "activation",
      "name" : "conv_pw_7_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_8_relu_output_relu",
      "blob_weights" : 63,
      "K" : 256,
      "blob_biases" : 61,
      "name" : "conv_dw_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_7_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_8_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_8_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_8_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_8_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_8_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_8_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_8_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_8_relu_output",
      "type" : "activation",
      "name" : "conv_dw_8_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_8_relu_output_relu",
      "blob_weights" : 67,
      "K" : 256,
      "blob_biases" : 65,
      "name" : "conv_pw_8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_8_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_8_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_8_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_8_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_8_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_8_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_8_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_8_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_8_relu_output",
      "type" : "activation",
      "name" : "conv_pw_8_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_9_relu_output_relu",
      "blob_weights" : 71,
      "K" : 256,
      "blob_biases" : 69,
      "name" : "conv_dw_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_8_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_9_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_9_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_9_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_9_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_9_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_9_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_9_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_9_relu_output",
      "type" : "activation",
      "name" : "conv_dw_9_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_9_relu_output_relu",
      "blob_weights" : 75,
      "K" : 256,
      "blob_biases" : 73,
      "name" : "conv_pw_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_9_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_9_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_9_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_9_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_9_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_9_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_9_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_9_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_9_relu_output",
      "type" : "activation",
      "name" : "conv_pw_9_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_10_relu_output_relu",
      "blob_weights" : 79,
      "K" : 256,
      "blob_biases" : 77,
      "name" : "conv_dw_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_9_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_10_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_10_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_10_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_10_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_10_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_10_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_10_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_10_relu_output",
      "type" : "activation",
      "name" : "conv_dw_10_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_10_relu_output_relu",
      "blob_weights" : 83,
      "K" : 256,
      "blob_biases" : 81,
      "name" : "conv_pw_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_10_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_10_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_10_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_10_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_10_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_10_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_10_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_10_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_10_relu_output",
      "type" : "activation",
      "name" : "conv_pw_10_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_11_relu_output_relu",
      "blob_weights" : 87,
      "K" : 256,
      "blob_biases" : 85,
      "name" : "conv_dw_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_10_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_11_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_11_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_11_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_11_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_11_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_11_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_11_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_11_relu_output",
      "type" : "activation",
      "name" : "conv_dw_11_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_11_relu_output_relu",
      "blob_weights" : 91,
      "K" : 256,
      "blob_biases" : 89,
      "name" : "conv_pw_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_dw_11_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_11_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_11_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_11_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_11_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_11_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_11_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_11_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_11_relu_output",
      "type" : "activation",
      "name" : "conv_pw_11_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_12_relu_output_relu",
      "blob_weights" : 95,
      "K" : 256,
      "blob_biases" : 93,
      "stride_x" : 2,
      "name" : "conv_dw_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_11_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_12_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_12_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_12_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_12_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_12_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_12_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_12_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_12_relu_output",
      "type" : "activation",
      "name" : "conv_dw_12_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_12_relu_output_relu",
      "blob_weights" : 99,
      "K" : 256,
      "blob_biases" : 97,
      "name" : "conv_pw_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv_dw_12_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_12_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_12_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_12_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_12_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_12_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_12_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_12_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_12_relu_output",
      "type" : "activation",
      "name" : "conv_pw_12_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_13_relu_output_relu",
      "blob_weights" : 103,
      "K" : 512,
      "blob_biases" : 101,
      "name" : "conv_dw_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv_pw_12_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_13_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_13_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_13_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_13_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_13_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_13_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_13_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_13_relu_output",
      "type" : "activation",
      "name" : "conv_dw_13_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_13_relu_output_relu",
      "blob_weights" : 107,
      "K" : 512,
      "blob_biases" : 105,
      "name" : "conv_pw_13",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv_dw_13_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_13_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_13_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_13_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_13_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_13_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_13_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_13_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_13_relu_output",
      "type" : "activation",
      "name" : "conv_pw_13_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_transpose_1_output",
      "blob_weights" : 111,
      "K" : 512,
      "blob_biases" : 109,
      "stride_x" : 2,
      "name" : "conv2d_transpose_1",
      "deconv_out_height" : 14,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv_pw_13_relu_output",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 1,
      "deconv_out_width" : 14,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_1_output",
      "type" : "concat",
      "name" : "concatenate_1",
      "bottom" : "conv2d_transpose_1_output,conv_pw_11_relu_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_14_relu_output_relu",
      "blob_weights" : 115,
      "K" : 512,
      "blob_biases" : 113,
      "name" : "conv_dw_14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "concatenate_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_14_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_14_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_14_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_14_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_14_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_14_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_14_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_14_relu_output",
      "type" : "activation",
      "name" : "conv_dw_14_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_14_relu_output_relu",
      "blob_weights" : 119,
      "K" : 512,
      "blob_biases" : 117,
      "name" : "conv_pw_14",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_dw_14_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_14_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_14_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_14_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_14_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_14_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_14_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_14_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_14_relu_output",
      "type" : "activation",
      "name" : "conv_pw_14_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_transpose_2_output",
      "blob_weights" : 123,
      "K" : 128,
      "blob_biases" : 121,
      "stride_x" : 2,
      "name" : "conv2d_transpose_2",
      "deconv_out_height" : 28,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv_pw_14_relu_output",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 1,
      "deconv_out_width" : 28,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_2_output",
      "type" : "concat",
      "name" : "concatenate_2",
      "bottom" : "conv2d_transpose_2_output,conv_pw_5_relu_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_15_relu_output_relu",
      "blob_weights" : 127,
      "K" : 256,
      "blob_biases" : 125,
      "name" : "conv_dw_15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "concatenate_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_15_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_15_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_15_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_15_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_15_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_15_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_15_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_15_relu_output",
      "type" : "activation",
      "name" : "conv_dw_15_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_15_relu_output_relu",
      "blob_weights" : 131,
      "K" : 256,
      "blob_biases" : 129,
      "name" : "conv_pw_15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_dw_15_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_15_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_15_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_15_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_15_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_15_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_15_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_15_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_15_relu_output",
      "type" : "activation",
      "name" : "conv_pw_15_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_transpose_3_output",
      "blob_weights" : 135,
      "K" : 64,
      "blob_biases" : 133,
      "stride_x" : 2,
      "name" : "conv2d_transpose_3",
      "deconv_out_height" : 56,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv_pw_15_relu_output",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 1,
      "deconv_out_width" : 56,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_3_output",
      "type" : "concat",
      "name" : "concatenate_3",
      "bottom" : "conv2d_transpose_3_output,conv_pw_3_relu_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_dw_16_relu_output_relu",
      "blob_weights" : 139,
      "K" : 128,
      "blob_biases" : 137,
      "name" : "conv_dw_16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "concatenate_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_16_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_16_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_dw_16_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_dw_16_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_dw_16_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_dw_16_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "conv_dw_16_relu_output_relu_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_dw_16_relu_output",
      "type" : "activation",
      "name" : "conv_dw_16_relu_neg2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv_pw_16_relu_output_relu",
      "blob_weights" : 143,
      "K" : 128,
      "blob_biases" : 141,
      "name" : "conv_pw_16",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv_dw_16_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "conv_pw_16_relu_output_relu",
      "weights" : {

      },
      "mode" : 6,
      "top" : "conv_pw_16_relu_output_relu_neg",
      "type" : "activation",
      "name" : "conv_pw_16_relu__neg__",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "conv_pw_16_relu_output_relu_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "conv_pw_16_relu_output_relu_clip",
      "type" : "elementwise",
      "name" : "conv_pw_16_relu__clip__",
      "beta" : 0
    },
    {
      "alpha" : -1,
